package com.gwego.constants;

/**
 * Created by 刘东旭 on 2018/7/28.
 */
public interface Constants {
    byte STATUS_OFF = 0;
    byte STATUS_ON = 1;

    /**
     * 移动号段：
     * <p>
     * 134 135 136 137 138 139 147 148 150 151 152 157 158 159 172 178 182 183 184 187 188 198
     * 联通号段：
     * <p>
     * 130 131 132 145 146 155 156 166 171 175 176 185 186
     * 电信号段：
     * <p>
     * 133 149 153 173 174 177 180 181 189 199
     * 虚拟运营商:
     * <p>
     * 170
     */
    String MOBILE_REGEX = "^(13[0-9]|14[5-9]|15[0-3,5-9]|16[6]|17[0135678]|18[0-9]|19[89])\\d{8}$";
}
